Учет_кабельной_продукции/src/Documents/ЗаявкиНаЗакупки/ЗаявкиНаЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкиНаЗакупки</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ДанныеПоЗаявкамНаЗакупку</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>299</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВКНаКПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>299</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/InformationRegisters/АктВходногоКонтроляНаКЛ/АктВходногоКонтроляНаКЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктВходногоКонтроляНаКЛ</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыВК</types>
    </type>
  </resources>
  <dimensions>
    <name>КабельнаяЛиния</name>
    <type>
      <types>CatalogRef.КабельныеЛинии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_кабельной_продукции/src/Enums/СтатусыВК/СтатусыВК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВК</name>
  <enumValues>
    <name>ВКПройден</name>
  </enumValues>
  <enumValues>
    <name>ВКНеПройден</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Documents/ЗаявкиНаЗакупки/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	ЗафиксироватьДанныеНомераВК();	
	
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда   
		СписокСвязанныхДокументов = КонтрольУдаленияДокументовСервер.ПолучитьСвязанныеДокументыЗаявкиНаЗакупки(Ссылка);		
		КонтрольУдаленияДокументовСервер.ПроверитьЕстьСвязанныеДокументыПередПометкойУдаления(Ссылка, СписокСвязанныхДокументов, Отказ);		
	КонецЕсли;	
	
	СканДокументаПрикреплен = Истина;
	Для Каждого ТекСтрТЧ Из КабельныеЛинии Цикл    
		Если СокрЛП(ТекСтрТЧ.НомерВКНаКПП) = "" Тогда 
			СканДокументаПрикреплен = Ложь;
		КонецЕсли;	
	КонецЦикла;	
	
	СтатусКабельнойЛинии = СтатусыСервер.ПолучитьСтатусКабельнойЛинии(Статус, ПометкаУдаления, СканДокументаПрикреплен);     
	Если ЗначениеЗаполнено(СтатусКабельнойЛинии) Тогда
		ПроведениеСервер.ЗаписьДанныеВРСДанныеЖКП(КабельныеЛинии,,СтатусКабельнойЛинии, Истина);   
	КонецЕсли;	
	
КонецПроцедуры


#Область ПрочиеПроцедурыИФункции
Процедура ЗафиксироватьДанныеНомераВК()  
	
	СписокУдаляемыхКЛ = ОбщегоНазначенияПереопределяемый.СписокУдаляемыхСтрокКабельныеЛинии(Ссылка, КабельныеЛинии);
	Для Каждого УдаляемыйКабель Из СписокУдаляемыхКЛ Цикл   
		МенеджерЗаписи = РегистрыСведений.АктВходногоКонтроляНаКЛ.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.КабельнаяЛиния = УдаляемыйКабель;
		МенеджерЗаписи.Удалить();				
	КонецЦикла;	
		
	Для Каждого ТекСтр Из КабельныеЛинии Цикл          
		
		Состояние = Перечисления.СтатусыВК.ВКНеПройден;
		Если СокрЛП(ТекСтр.НомерВКНаКПП) <> "" Тогда    
			Состояние = Перечисления.СтатусыВК.ВКПройден;
		КонецЕсли;

		МенеджерЗаписи = РегистрыСведений.АктВходногоКонтроляНаКЛ.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекСтр);
		МенеджерЗаписи.Состояние = Состояние;
		МенеджерЗаписи.Записать();		
	КонецЦикла;	
	
КонецПроцедуры	


#КонецОбласти
